{
  "programs": [
    {
      "id": 1,
      "imageUrl": "https://i.postimg.cc/5tMS9rF8/program-1.png",
      "name": "ВЗРЫВной рост мышц",
      "shortText": "Избавьтесь от тренировочной рутины и приготовьтесь к взрывному росту массы и силовых показателей, используя уникальную комбинацию различных подходов и упражнений, разработанными нашими тренерами.",
      "longText": "Избавьтесь от тренировочной рутины и приготовьтесь к взрывному росту массы и силовых показателей, используя уникальную комбинацию различных подходов и упражнений, разработанными нашими тренерами. Эта программа дает гарантированный  результат, поскольку также включает описание комплексного рациона питания, способствующего сократить время достижения желаемых результатов. Тренировки по нашей системе позволят бескоппромиссно усилить рост мышц при уже имеющейся минимальной подготовке к физическим нагрузкам.",
      "price": 4800,
      "gender": 0,
      "age": "2, 3, 4",
      "level": "2, 3, 4",
      "result": 2
    },

    {
      "id": 2,
      "imageUrl": "https://i.postimg.cc/c4pQTzhP/program-2.png",
      "name": "Жиросжигание по-королевски",
      "shortText": "Данная программа представляет собой комплексную процедуру, предпо лагающую особую схему питания и регулярные силовые тренировки. Основным ее назначением является уменьшение подкожного слоя жира для конечной демонстрации своих результатов в виде наработанной мышечной массы.",
      "longText": "Данная программа представляет собой комплексную процедуру, предполагающую особую схему питания и регулярные силовые тренировки. Основным ее назначением является уменьшение подкожного слоя жира для конечной демонстрации своих результатов в виде наработанной мышечной массы. Уменьшение жирового слоя помогает сделать мышцы более четкими и сухими. Итоговое состояние обычно удерживают несколько дней, и затем вновь переходят к восстановлению жирового слоя. Программа направлена на получение быстрого и уверенного результата.",
      "price": 2500,
      "gender": 0,
      "age": "2, 3, 4",
      "level": "3, 4",
      "result": 0
    },

    {
      "id": 3,
      "imageUrl": "https://i.postimg.cc/k539FGw3/program-3.png",
      "name": "Кроссфит 2.0",
      "shortText": "Кроссфит 2.0 - это интенсивная система физических тренировок, которые включают в себя элементы гимнастики, легкой и тяжелой атлетики.",
      "longText": "Кроссфит 2.0 - это интенсивная система физических тренировок, которые включают в себя элементы гимнастики, легкой и тяжелой атлетики. Наша программа может помочь развить психологическую стойкость, поскольку требует от занимающегося выносливости, силы воли и умения управлять своими эмоциями. Тренировки кроссфита могут быть очень интенсивными и требовательными, что может вызвать усталость и стресс. Однако, регулярные занятия кроссфитом могут помочь развить выносливость и силу воли, что может быть полезно не только в тренировочном процессе, но и в повседневной жизни.",
      "price": 3600,
      "gender": 0,
      "age": "2, 3, 4",
      "level": "3, 4",
      "result": 1
    },

    {
      "id": 4,
      "imageUrl": "https://i.postimg.cc/nLZghD0z/program-4.png",
      "name": "Сила и выносливость",
      "shortText": "Данная программа предполагает особую совокупность кардионагрузки и силового тренинга. При такой схеме тренировок направление и характер занятий  изменяется каждый день.",
      "longText": "Данная программа предполагает особую совокупность кардионагрузки и силового тренинга. При такой схеме тренировок направление и характер занятий изменяется каждый день. Благодаря грамотному подходу наших тренеров вы сможете добиться увеличения силовых показателей, а также выносливости, поскольку в тот день, когда на организм оказывается кардионагрузка, мышцы отдыхают от силового воздействия, оказываемого на них накануне.",
      "price": 2300,
      "gender": 0,
      "age": "2, 3, 4",
      "level": "2, 3, 4",
      "result": "0, 1"
    },

    {
      "id": 5,
      "imageUrl": "https://i.postimg.cc/Hk1P6MG2/program-5.png",
      "name": "Точка входа",
      "shortText": "Главная цель, с которой большинство людей приходят в тренажерный зал, является желание стать обладателем внушительной и рельефной мускулатуры. Чтобы реализовать свою мечту, недостаточно просто заниматься на тренажерах. ",
      "longText": "Главная цель, с которой большинство людей приходят в тренажерный зал, является желание стать обладателем внушительной и рельефной мускулатуры. Чтобы реализовать свою мечту, недостаточно просто заниматься на тренажерах. Добиться по-настоящему впечатляющих результатов позволяет только правильно составленная программа тренировок для начинающих. И если профессиональные спортсмены уже имеют достаточно знаний для построения грамотного занятия, новичкам приходится гораздо сложней. Данная программа поможет в том, чтобы вход в мир спорта был правильным и не привел к травмам.",
      "price": 2900,
      "gender": 0,
      "age": "2, 3, 4",
      "level": "1",
      "result": "0, 2"
    },

    {
      "id": 6,
      "imageUrl": "https://i.postimg.cc/C15vRHDF/program-6.png",
      "name": "Аэробика",
      "shortText": " Для похудения нужны интенсивные тренировки, помогающие сжигать лишний жир. Одно из популярных направлений – аэробика. Суть данной программы заключается в циклическом выполнении упражнений с относительно высоким пульсом.",
      "longText": "Для похудения нужны интенсивные тренировки, помогающие сжигать лишний жир. Одно из популярных направлений – аэробика. Суть данной программы заключается в циклическом выполнении упражнений с относительно высоким пульсом. За долгие годы развития она успела получить популярность и разделиться на разные виды. Но данная программа включает в себя все элементы классической аэробики: бег, прыжки, фитбол, степ и др.",
      "price": 1800,
      "gender": 2,
      "age": "0",
      "level": "0",
      "result": "0, 1"
    },

    {
      "id": 7,
      "imageUrl": "https://i.postimg.cc/mDP0vGmN/program-7.png",
      "name": "Пауэрлифтинг",
      "shortText": "Пауэрлифтинг — это силовой вид спорта, который включает в себя три упражнения: подъём штанги в приседе, жим лёжа и становую тягу. Иначе его называют силовым троеборьем.",
      "longText": "Пауэрлифтинг — это силовой вид спорта, который включает в себя три упражнения: подъём штанги в приседе, жим лёжа и становую тягу. Иначе его называют силовым троеборьем. Однако чтобы добиться результата и не навредить себе, требуется правильная техника выполнения, а также очередность упражнений. Данная программа содержит в себе все необходимое для начинающих и не только пауэрлифтеров.",
      "price": 3000,
      "gender": 1,
      "age": "2, 3",
      "level": "3, 4",
      "result": "2"
    },

    {
      "id": 8,
      "imageUrl": "https://i.postimg.cc/W43KZvcL/program-8.png",
      "name": "ПротивоВЕС",
      "shortText": "Рано или поздно многие люди приходят к осознанию необходимости регулярной физической нагрузки. Кто-то хочет сбросить лишний вес, кто-то мечтает о рельефном прессе, кто-то хочет укрепить мышцы, кто-то стремится стать более выносливым.",
      "longText": "Рано или поздно многие люди приходят к осознанию необходимости регулярной физической нагрузки. Кто-то хочет сбросить лишний вес, кто-то мечтает о рельефном прессе, кто-то хочет укрепить мышцы, кто-то стремится стать более выносливым. Цели могут быть разными, причём для их достижения не обязательно идти в фитнес-клуб или приобретать дорогостоящие тренажёры. Для качественных тренировок достаточно нашей программы, а лучшим тренажёром, который всегда с вами, будет ваше собственное тело.",
      "price": 1500,
      "gender": 0,
      "age": "1, 2, 3",
      "level": "1, 2",
      "result": "0, 1"
    },

    {
      "id": 9,
      "imageUrl": "https://i.postimg.cc/0QKBt0NV/program-9.png",
      "name": "Стрейчинг",
      "shortText": "Стрейчинг - система упражнений на гибкость, которая может быть использована как часть основной тренировки или как самостоятельное спортивное направление. В первом случае растяжка проводится в начале тренинга для разминки мышц и разогрева суставов и в конце для ускорения восстановления, укрепления мышц и успокоения нервной системы после интенсивной тренировки.",
      "longText": "Стрейчинг - система упражнений на гибкость, которая может быть использована как часть основной тренировки или как самостоятельное спортивное направление. В первом случае растяжка проводится в начале тренинга для разминки мышц и разогрева суставов и в конце для ускорения восстановления, укрепления мышц и успокоения нервной системы после интенсивной тренировки. Регулярное выполнение упражнений на растяжку улучшает подвижность и гибкость тела, увеличивает эффективность силовых тренировок, а наша программа станет незаменимым инструментом для достижения ваших целей.",
      "price": 1100,
      "gender": 2,
      "age": "2, 3",
      "level": "0",
      "result": "1"
    },

    {
      "id": 10,
      "imageUrl": "https://i.postimg.cc/tgYSTNF9/program-10.png",
      "name": "Street_Workout",
      "shortText": "Не каждый хочет быть огромным громилой весом за 100 килограмм. Большинство мужчин стремятся к сухости и красивой V-образной фигуре с узкой талией и широкими плечами. Чтобы достичь подобной фигуры, тренажёрный зал посещать необязательно, достаточно тренироваться на турниках.",
      "longText": "Стрейчинг - система упражнений на гибкость, которая может быть использована как часть основной тренировки или как самостоятельное спортивное направление. В первом случае растяжка проводится в начале тренинга для разминки мышц и разогрева суставов и в конце для ускорения восстановления, укрепления мышц и успокоения нервной системы после интенсивной тренировки. Регулярное выполнение упражнений на растяжку улучшает подвижность и гибкость тела, увеличивает эффективность силовых тренировок, а наша программа станет незаменимым инструментом для достижения ваших целей.",
      "price": 1800,
      "gender": 1,
      "age": "2, 3",
      "level": "0",
      "result": "1"
    },

    {
      "id": 11,
      "imageUrl": "https://i.postimg.cc/ZRNwPYfg/program-11.png",
      "name": "Пилатес",
      "shortText": "С помощью упражнений из пилатеса можно подтянуть фигуру, сделать ее гармоничной, снять боли в спине, укрепить сердечно-сосудистую систему, снять стресс. И это лишь часть полезных свойств популярной системы тренировок.",
      "longText": "С помощью упражнений из пилатеса можно подтянуть фигуру, сделать ее гармоничной, снять боли в спине, укрепить сердечно-сосудистую систему, снять стресс. И это лишь часть полезных свойств популярной системы тренировок. Благодаря отсутствию ударных нагрузок и щадящему действию на организм занятия подходят даже для будущих мам. В нашей программе собраны лучшие практики от ведущих экспертов в области пилатеса.",
      "price": 1200,
      "gender": 2,
      "age": "0",
      "level": "0",
      "result": "0, 1"
    },

    {
      "id": 12,
      "imageUrl": "https://i.postimg.cc/Vsj7d600/program-12.png",
      "name": "Кардио. Start",
      "shortText": "Кардиотренировка − это именно тот случай, когда одновременно с укреплением организма упражнения помогают избавиться от подкожного жира. Движения восстанавливаюти поддерживают здоровье сердца и сосудов, повышают выносливость и нормализуют обмен веществ.",
      "longText": "Кардиотренировка − это именно тот случай, когда одновременно с укреплением организма упражнения помогают избавиться от подкожного жира. Движения восстанавливаюти поддерживают здоровье сердца и сосудов, повышают выносливость и нормализуют обмен веществ. Кроме того, кардионагрузка помогает человеку осознать, как и зачем нужно вести активный образ жизни. Стоит только начать. А начать рекомендуем с нашей разработанной экспертами программы, с которой ваши результаты станут виды уже через месяц занятий.",
      "price": 2000,
      "gender": 0,
      "age": "2, 3, 4",
      "level": "1, 2",
      "result": "1"
    },

    {
      "id": 13,
      "imageUrl": "https://i.postimg.cc/vmJzmFQv/program-13.png",
      "name": "Атлетизм. Challenge",
      "shortText": "Если человек обладает большой силой, то ему по плечу решение многих жизненных задач. Обладая достаточными силовыми показателями, ваша фигура будет быстрее приобретать желаемый вид. Сила влияет на все спортивные показатели.",
      "longText": "Если человек обладает большой силой, то ему по плечу решение многих жизненных задач. Обладая достаточными силовыми показателями, ваша фигура будет быстрее приобретать желаемый вид. Сила влияет на все спортивные показатели. Данная программа составлена для опытных атлетов, которые готовы бросить вызов самим себе.",
      "price": 3100,
      "gender": 1,
      "age": "2, 3",
      "level": "4",
      "result": "2"
    },

    {
      "id": 14,
      "imageUrl": "https://i.postimg.cc/xjyR94BK/program-14.png",
      "name": "Кардио. NonStop",
      "shortText": "Быстрее. Быстрее. Жестче. Еще быстрее. Если вы не готовы к такому темпу, то NonStop не для вас.",
      "longText": "Быстрее. Быстрее. Жестче. Еще быстрее. Если вы не готовы к такому темпу, то NonStop не для вас. Но если вы уже имеете должную подготовку, эта программа поможет подтянуть тело к лету и не только. Вас ждет головокружительный темп, зашкаливающий пульс и, конечно же, победы над большими дистанциями",
      "price": 2200,
      "gender": 0,
      "age": "2, 3",
      "level": "3, 4",
      "result": "0, 1"
    },

    {
      "id": 15,
      "imageUrl": "https://i.postimg.cc/mDTPj8Vs/program-15.png",
      "name": "Спортивная гимнастика",
      "shortText": "Гимнастика для детей — вид спорта, который имеет много разновидностей от упражнений, развивающих физические способности, до невероятных акробатических элементов.",
      "longText": "Гимнастика для детей — вид спорта, который имеет много разновидностей от упражнений, развивающих физические способности, до невероятных акробатических элементов. Физические упражнения в нашей программе подбираются так, чтобы максимально гармонично развивать тело. И даже если ваш ребенок не мечтате стать профессиональным спортсменом, любой вид гимнастики сделает его сильным физически и морально.",
      "price": 1200,
      "gender": 0,
      "age": "1",
      "level": "1",
      "result": "1"
    }
  ],

  "products": [
    {
      "id": 1,
      "imageUrl": "./img/products/product-1.png",
      "productName": "Optimum Nutrition",
      "productWeight": [0, 1],
      "price": 2000,
      "type": 0
    },

    {
      "id": 2,
      "imageUrl": "./img/products/product-2.png",
      "productName": "Chrome Whey",
      "productWeight": [0],
      "price": 1800,
      "type": 0
    },

    {
      "id": 3,
      "imageUrl": "./img/products/product-3.png",
      "productName": "Combat Power",
      "productWeight": [0, 1],
      "price": 1700,
      "type": 0
    },

    {
      "id": 4,
      "imageUrl": "./img/products/product-4.png",
      "productName": "Optimum Nutrition Gold Standard",
      "productWeight": [0, 1],
      "price": 2600,
      "type": 0
    },

    {
      "id": 5,
      "imageUrl": "./img/products/product-5.png",
      "productName": "3 Matrix Whey",
      "productWeight": [1],
      "price": 1600,
      "type": 0
    },

    {
      "id": 6,
      "imageUrl": "./img/products/product-6.png",
      "productName": "RMC",
      "productWeight": [0, 1],
      "price": 1500,
      "type": 0
    },
    {
      "id": 7,
      "imageUrl": "./img/products/product-7.png",
      "productName": "Optimum Nutrition",
      "productWeight": [0, 1],
      "price": 1600,
      "type": 1
    },

    {
      "id": 8,
      "imageUrl": "./img/products/product-8.png",
      "productName": "Xplode BCAA",
      "productWeight": [0, 1],
      "price": 1100,
      "type": 1
    },

    {
      "id": 9,
      "imageUrl": "./img/products/product-9.png",
      "productName": "MP Essentials",
      "productWeight": [0],
      "price": 900,
      "type": 1
    },

    {
      "id": 10,
      "imageUrl": "./img/products/product-10.png",
      "productName": "VPlab Nutrition",
      "productWeight": [0, 1],
      "price": 1000,
      "type": 1
    },

    {
      "id": 11,
      "imageUrl": "./img/products/product-11.png",
      "productName": "Mutant BCAA",
      "productWeight": [1],
      "price": 1400,
      "type": 1
    },

    {
      "id": 12,
      "imageUrl": "./img/products/product-12.png",
      "productName": "IntegralMedica",
      "productWeight": [0, 1],
      "price": 1300,
      "type": 1
    },

    {
      "id": 13,
      "imageUrl": "./img/products/product-13.png",
      "productName": "Optimum Nutrition",
      "productWeight": [1],
      "price": 1800,
      "type": 2
    },

    {
      "id": 14,
      "imageUrl": "./img/products/product-14.png",
      "productName": "Universal Creatine",
      "productWeight": [0, 1],
      "price": 700,
      "type": 2
    },

    {
      "id": 15,
      "imageUrl": "./img/products/product-15.png",
      "productName": "Xplode Creatine",
      "productWeight": [0],
      "price": 1000,
      "type": 2
    },

    {
      "id": 16,
      "imageUrl": "./img/products/product-16.png",
      "productName": "Platinum Creatine",
      "productWeight": [0, 1],
      "price": 1100,
      "type": 2
    },

    {
      "id": 17,
      "imageUrl": "./img/products/product-17.png",
      "productName": "ProteinCO Creatine",
      "productWeight": [1],
      "price": 900,
      "type": 2
    },

    {
      "id": 18,
      "imageUrl": "./img/products/product-18.png",
      "productName": "Labmerts Creatine",
      "productWeight": [0, 1],
      "price": 1400,
      "type": 2
    }
  ],

  "trainers": [
    {
      "id": 1,
      "imageUrl": "./img/trainers/trainer-1.png",
      "name": "Валерий",
      "age": 26,
      "days": [0, 2]
    },

    {
      "id": 2,
      "imageUrl": "./img/trainers/trainer-2.png",
      "name": "Виктория",
      "age": 30,
      "days": [0, 2]
    },

    {
      "id": 3,
      "imageUrl": "./img/trainers/trainer-3.png",
      "name": "Роман",
      "age": 23,
      "days": [0, 2]
    },

    {
      "id": 4,
      "imageUrl": "./img/trainers/trainer-4.png",
      "name": "Елизавета",
      "age": 28,
      "days": [1, 3]
    },

    {
      "id": 5,
      "imageUrl": "./img/trainers/trainer-5.png",
      "name": "Артур",
      "age": 31,
      "days": [1, 3]
    },

    {
      "id": 6,
      "imageUrl": "./img/trainers/trainer-6.png",
      "name": "Наталья",
      "age": 22,
      "days": [1, 3]
    },

    {
      "id": 7,
      "imageUrl": "./img/trainers/trainer-7.png",
      "name": "Алексей",
      "age": 25,
      "days": [0, 2]
    },

    {
      "id": 8,
      "imageUrl": "./img/trainers/trainer-8.png",
      "name": "Игорь",
      "age": 38,
      "days": [1, 3]
    }
  ],

  "machines": [
    {
      "id": 1,
      "imageUrl": "./img/machines/machine-1.png",
      "machineName": "Olmex.№1",
      "muscleType": "0, 1"
    },

    {
      "id": 2,
      "imageUrl": "./img/machines/machine-2.png",
      "machineName": "Скамья для приседаний",
      "muscleType": "2"
    },

    {
      "id": 3,
      "imageUrl": "./img/machines/machine-3.png",
      "machineName": "Bowflex. Giant",
      "muscleType": "0, 1, 3"
    },

    {
      "id": 4,
      "imageUrl": "./img/machines/machine-4.png",
      "machineName": "RipperM. XL",
      "muscleType": "0, 1"
    },

    {
      "id": 5,
      "imageUrl": "./img/machines/machine-5.png",
      "machineName": "Скамья Скотта № 1",
      "muscleType": "4"
    },

    {
      "id": 6,
      "imageUrl": "./img/machines/machine-6.png",
      "machineName": "Скамья для жима лежа",
      "muscleType": "0"
    },

    {
      "id": 7,
      "imageUrl": "./img/machines/machine-7.png",
      "machineName": "Стойка для приседаний",
      "muscleType": "2"
    },

    {
      "id": 8,
      "imageUrl": "./img/machines/machine-8.png",
      "machineName": "Startex №1",
      "muscleType": "1, 3"
    },

    {
      "id": 9,
      "imageUrl": "./img/machines/machine-9.png",
      "machineName": "Скамья Скотта №2",
      "muscleType": "4"
    },

    {
      "id": 10,
      "imageUrl": "./img/machines/machine-10.png",
      "machineName": "CortEX.PRO",
      "muscleType": "2"
    },

    {
      "id": 11,
      "imageUrl": "./img/machines/machine-11.png",
      "machineName": "Atlant Stainless",
      "muscleType": "0, 1, 2"
    },

    {
      "id": 12,
      "imageUrl": "./img/machines/machine-12.png",
      "machineName": "Virginia. Rusty",
      "muscleType": "0, 1"
    },

    {
      "id": 13,
      "imageUrl": "./img/machines/cardio-machine-1.png",
      "machineName": "Велотренажер №1",
      "muscleType": ""
    },

    {
      "id": 14,
      "imageUrl": "./img/machines/cardio-machine-2.png",
      "machineName": "Беговая дорожка №1",
      "muscleType": ""
    },

    {
      "id": 15,
      "imageUrl": "./img/machines/cardio-machine-3.png",
      "machineName": "Велотренажер №2",
      "muscleType": ""
    },

    {
      "id": 16,
      "imageUrl": "./img/machines/cardio-machine-4.png",
      "machineName": "Беговая дорожка №2",
      "muscleType": ""
    },

    {
      "id": 17,
      "imageUrl": "./img/machines/cardio-machine-5.png",
      "machineName": "Эллипсоид №1",
      "muscleType": ""
    },

    {
      "id": 18,
      "imageUrl": "./img/machines/cardio-machine-6.png",
      "machineName": "Эллипсоид №2",
      "muscleType": ""
    }
  ]
}
